const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test("20 + 1 เท่ากับ 21", ()=> {
  expect(sum(20, 1)).toBe(21)
});

// 2 + 5 เท่ากับ 7
test("2 + 5 เท่ากับ 7", ()=> {
  expect(sum(2, 5)).toBe(7)
});

// 2+2 = เท่ากับ 4

test("2+2 = เท่ากับ 4", ()=> {
  expect(sum(2, 2)).toBe(4)
})

// -15 + 15 เท่ากับ 0

test("-15 + 15 เท่ากับ 0", ()=> {
  expect(sum(-15, 15)).toBe(0)
})

// -20 + -20 เท่ากับ -40

test("-20 + -20 เท่ากับ -40", ()=> {
  expect(sum(-20, -20)).toBe(-40)
})

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
